In [109]:
import pyspark
from pyspark.sql import SparkSession

In [111]:
spark=SparkSession.builder.appName('Practice1').getOrCreate()
spark

In [128]:
filepath = r'D:\python\meTryPython\learnspark\first\resources\test2.csv'
df_spark=spark.read.csv(filepath,header=True,inferSchema=True)
df_spark.show()
df_spark.printSchema()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sundhansh| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     null| 34|        10| 38000|
|     null| 36|      null|  null|
+---------+---+----------+------+

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: string (nullable = true)
 |-- Salary: string (nullable = true)

**you can specify how spark will read the null value**

In [140]:
df_spark = spark.read \
    .option("header", True) \
    .option("nullValue", "null") \
    .csv(filepath)

In [133]:
df_spark.drop('Name').show()

+---+----------+------+
|Age|Experience|Salary|
+---+----------+------+
| 31|        10| 30000|
| 30|         8| 25000|
| 29|         4| 20000|
| 24|         3| 20000|
| 21|         1| 15000|
| 23|         2| 18000|
| 34|        10| 38000|
| 36|      null|  null|
+---+----------+------+

In [143]:
df_spark.na.drop().show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sundhansh| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [149]:
df_spark.na.drop(how='all').show()#milih cmn row yg semua kolomnya null
df_spark.na.drop(how='any').show() #milih apakah minimal ada satu null bakal didrop
df_spark.na.drop(how="any",subset=['Name']).show() #milih kolom mana yg disortir

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sundhansh| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     null| 34|        10| 38000|
|     null| 36|      null|  null|
+---------+---+----------+------+

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sundhansh| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sundhansh| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+